Catalogs/ЭтапыПроцессов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>ЭтапыПроцессов</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИдентификаторПоддержки</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>РезультатыВыполнения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ПредставлениеРезультата</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>30</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатусПослеВыполнения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтатусыДокументов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОтрицательныйРезультат</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТребуетсяЭП</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТребуетсяПростаяЭП</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Скрытый</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/ЭтапыПроцессов/Forms/ФормаЭлемента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьЗаголовкиЭП();
	
	ПроцессыОбработкиДокументовПереопределяемый.ПриСозданииНаСервереФормыЭтапаПроцесса(ЭтотОбъект);
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ШаблоныПроцессов.Отбор, "ЭтапШаблонаПроцесса", Объект.Ссылка,,, Истина);
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	ИдентификаторПоддержкиСтрокой = Объект.ИдентификаторПоддержки;
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Если ЗначениеЗаполнено(ИдентификаторПоддержкиСтрокой)
		И ИдентификаторПоддержкиСтрокой <> Строка(ТекущийОбъект.ИдентификаторПоддержки) Тогда
		ТекущийОбъект.ИдентификаторПоддержки = Новый УникальныйИдентификатор(ИдентификаторПоддержкиСтрокой);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	ЗаполнитьЗаголовкиЭП();
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	Если ЗначениеЗаполнено(ИдентификаторПоддержкиСтрокой) Тогда
		Если Не СтроковыеФункцииКлиентСервер.ЭтоУникальныйИдентификатор(ИдентификаторПоддержкиСтрокой) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Введен некорректный уникальный идентификатор'"),,
				"ИдентификаторПоддержкиСтрокой",, Отказ);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если ПараметрыЗаписи.Свойство("ЗаписьРазрешена")
		ИЛИ НЕ Модифицированность
		ИЛИ Объект.Ссылка.Пустая()
		ИЛИ НЕ ЕстьСвязанныеШаблоны(Объект.Ссылка) Тогда
		Возврат;
	КонецЕсли;
	
	Отказ = Истина;
	
	ПараметрыОбработчика = Новый Структура;
	ПараметрыОбработчика.Вставить("ЗакрытьФорму", ЗакрытьФорму);
	
	ОповещениеОЗакрытии = Новый ОписаниеОповещения("ПослеЗакрытияФормыСвязанныеШаблоны", ЭтотОбъект, ПараметрыОбработчика);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Этап", Объект.Ссылка);
	
	ОткрытьФорму("Справочник.ЭтапыПроцессов.Форма.СвязанныеШаблоны", ПараметрыФормы, ЭтотОбъект, , , , ОповещениеОЗакрытии);
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	ЗакрытьФорму = Истина;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура КомментарийНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ОбщегоНазначенияКлиент.ПоказатьФормуРедактированияКомментария(Элемент.ТекстРедактирования,
																	ЭтотОбъект,
																	"Объект.Комментарий",
																	"Комментарий служебный");
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы_РезультатыВыполнения

&НаКлиенте
Процедура РезультатыВыполненияПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НЕ НоваяСтрока И НЕ Копирование Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные = Элементы.РезультатыВыполнения.ТекущиеДанные;
	
	ЗаполнитьЗаголовкиЭПВСтроке(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура РезультатыВыполненияТребуетсяЭППриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.РезультатыВыполнения.ТекущиеДанные;
	
	Если ТекущиеДанные.ТребуетсяЭП Тогда
		
		Если ТекущиеДанные.ТребуетсяПростаяЭП Тогда
			ТекущиеДанные.ТребуетсяПростаяЭП = Ложь;
			//ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Выключено свойство ""Требуется простая ЭП""'"));
		КонецЕсли;
		
		Если ТекущиеДанные.Скрытый Тогда
			ТекущиеДанные.Скрытый = Ложь;
			ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Выключено свойство ""Скрытый""'"));
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РезультатыВыполненияТребуетсяПростаяЭППриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.РезультатыВыполнения.ТекущиеДанные;
	
	Если ТекущиеДанные.ТребуетсяПростаяЭП Тогда
		
		Если ТекущиеДанные.ТребуетсяЭП Тогда
			ТекущиеДанные.ТребуетсяЭП = Ложь;
			//ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Выключено свойство ""Требуется простая ЭП""'"));
		КонецЕсли;
		
		Если ТекущиеДанные.Скрытый Тогда
			ТекущиеДанные.Скрытый = Ложь;
			ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Выключено свойство ""Скрытый""'"));
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РезультатыВыполненияСкрытыйПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.РезультатыВыполнения.ТекущиеДанные;
	
	Если ТекущиеДанные.Скрытый И (ТекущиеДанные.ТребуетсяЭП ИЛИ ТекущиеДанные.ТребуетсяПростаяЭП) Тогда
		
		ТекущиеДанные.ТребуетсяЭП = Ложь;
		ТекущиеДанные.ТребуетсяПростаяЭП = Ложь;
		
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Выключено свойство ""Требуется ЭП""'"));
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийТаблицыФормыШаблоныПроцессов

&НаКлиенте
Процедура ШаблоныПроцессовВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.ШаблоныПроцессов.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	
	Поле = Элементы.ШаблоныПроцессов.ТекущийЭлемент;
	
	Если ЗначениеЗаполнено(ТекущиеДанные.ШаблонПроцесса) Тогда
		ПоказатьЗначение(Неопределено, ТекущиеДанные.ШаблонПроцесса);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КомандаЗаписатьИЗакрыть(Команда)
	ЗакрытьФорму = Истина;
	ЭтотОбъект.Записать();
	Если НЕ Модифицированность И НЕ Объект.Ссылка.Пустая() Тогда
		Закрыть();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура КомандаЗаписать(Команда)
	ЗакрытьФорму = Ложь;
	ЭтотОбъект.Записать();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ПослеЗакрытияФормыСвязанныеШаблоны(РезультатЗакрытия, ДополнительныеПараметры) Экспорт
	
	Если РезультатЗакрытия = "ЗаписьРазрешена" Тогда
		
		ПараметрыЗаписи = Новый Структура("ЗаписьРазрешена");
		ЭтотОбъект.Записать(ПараметрыЗаписи);
		Оповестить("ЗаписьЭтапаПроцесса");
		
		Если ДополнительныеПараметры.ЗакрытьФорму Тогда
			Закрыть();
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЕстьСвязанныеШаблоны(Этап)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ШаблоныПроцессовЭтапы.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ШаблоныПроцессов.Этапы КАК ШаблоныПроцессовЭтапы
	|ГДЕ
	|	ШаблоныПроцессовЭтапы.Этап = &Этап";
	
	Запрос.УстановитьПараметр("Этап", Этап);
	
	Возврат НЕ Запрос.Выполнить().Пустой();
	
КонецФункции

&НаСервере
Функция ЗаполнитьЗаголовкиЭП()
	
	Для Каждого Строка Из Объект.РезультатыВыполнения Цикл
		ЗаполнитьЗаголовкиЭПВСтроке(Строка);
	КонецЦикла;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Процедура ЗаполнитьЗаголовкиЭПВСтроке(Строка)
	
	Строка.НадписьУсиленнаяЭП = (НСтр("ru = 'усиленная'"));
	Строка.НадписьПростаяЭП = (НСтр("ru = 'простая'"));
	
КонецПроцедуры

#КонецОбласти
